# [Taps]
tap "jonz94/sarasa-nerd-fonts"

# [Binaries]
brew "fd"       # Find replacement
brew "fnm"
brew "fzf"      # Fuzzy finder
brew "gh"
brew "git"
brew "git-crypt"
brew "jq"
brew "lazygit"
brew "neovim"
brew "rclone"
brew "ripgrep"  # Grep replacement
brew "starship"
brew "stow"
brew "tmux"
brew "zoxide"   # Cd replacement
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# [Fonts]
cask "font-lxgw-wenkai"
cask "font-sarasa-term-tc-nerd-font"

# [Applications]
cask "antigravity"
cask "arc"
cask "cryptomator"
cask "fuse-t"
cask "ghostty"
cask "miniforge"
cask "obsidian"
cask "tailscale-app"

# [VS Code]
